---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyJoinedGeometry
source: html/66277a6a-b7ef-9b44-1534-bbfe98c2154f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyJoinedGeometry Property

Joined solid geometry cannot be copied as a whole. Instead, select the individual extrusions, etc., using Pick box or Ctrl-select and copy them.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyJoinedGeometry { get; }
```